nxp-mcuxpresso/mcux-sdk/devices/MK22F12810/mcuxpresso/startup_mk22f12810.c
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM4
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    DebugMon_Handler,                  // Debug monitor handler
    0,                                 // Reserved
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler

    // Chip Level - MK22F12810
    DMA0_IRQHandler,            // 16: DMA Channel 0 Transfer Complete
    DMA1_IRQHandler,            // 17: DMA Channel 1 Transfer Complete
    DMA2_IRQHandler,            // 18: DMA Channel 2 Transfer Complete
    DMA3_IRQHandler,            // 19: DMA Channel 3 Transfer Complete
    Reserved20_IRQHandler,      // 20: Reserved interrupt
    Reserved21_IRQHandler,      // 21: Reserved interrupt
    Reserved22_IRQHandler,      // 22: Reserved interrupt
    Reserved23_IRQHandler,      // 23: Reserved interrupt
    Reserved24_IRQHandler,      // 24: Reserved interrupt
    Reserved25_IRQHandler,      // 25: Reserved interrupt
    Reserved26_IRQHandler,      // 26: Reserved interrupt
    Reserved27_IRQHandler,      // 27: Reserved interrupt
    Reserved28_IRQHandler,      // 28: Reserved interrupt
    Reserved29_IRQHandler,      // 29: Reserved interrupt
    Reserved30_IRQHandler,      // 30: Reserved interrupt
    Reserved31_IRQHandler,      // 31: Reserved interrupt
    DMA_Error_IRQHandler,       // 32: DMA Error Interrupt
    MCM_IRQHandler,             // 33: Normal Interrupt
    FTF_IRQHandler,             // 34: FTFA Command complete interrupt
    Read_Collision_IRQHandler,  // 35: Read Collision Interrupt
    LVD_LVW_IRQHandler,         // 36: Low Voltage Detect, Low Voltage Warning
    LLWU_IRQHandler,            // 37: Low Leakage Wakeup Unit
    WDOG_EWM_IRQHandler,        // 38: WDOG Interrupt
    Reserved39_IRQHandler,      // 39: Reserved interrupt
    I2C0_IRQHandler,            // 40: I2C0 interrupt
    I2C1_IRQHandler,            // 41: I2C1 interrupt
    SPI0_IRQHandler,            // 42: SPI0 Interrupt
    SPI1_IRQHandler,            // 43: SPI1 Interrupt
    I2S0_Tx_IRQHandler,         // 44: I2S0 transmit interrupt
    I2S0_Rx_IRQHandler,         // 45: I2S0 receive interrupt
    LPUART0_IRQHandler,         // 46: LPUART0 status/error interrupt
    UART0_RX_TX_IRQHandler,     // 47: UART0 Receive/Transmit interrupt
    UART0_ERR_IRQHandler,       // 48: UART0 Error interrupt
    UART1_RX_TX_IRQHandler,     // 49: UART1 Receive/Transmit interrupt
    UART1_ERR_IRQHandler,       // 50: UART1 Error interrupt
    UART2_RX_TX_IRQHandler,     // 51: UART2 Receive/Transmit interrupt
    UART2_ERR_IRQHandler,       // 52: UART2 Error interrupt
    Reserved53_IRQHandler,      // 53: Reserved interrupt
    Reserved54_IRQHandler,      // 54: Reserved interrupt
    ADC0_IRQHandler,            // 55: ADC0 interrupt
    CMP0_IRQHandler,            // 56: CMP0 interrupt
    CMP1_IRQHandler,            // 57: CMP1 interrupt
    FTM0_IRQHandler,            // 58: FTM0 fault, overflow and channels interrupt
    FTM1_IRQHandler,            // 59: FTM1 fault, overflow and channels interrupt
    FTM2_IRQHandler,            // 60: FTM2 fault, overflow and channels interrupt
    Reserved61_IRQHandler,      // 61: Reserved interrupt
    RTC_IRQHandler,             // 62: RTC interrupt
    RTC_Seconds_IRQHandler,     // 63: RTC seconds interrupt
    PIT0_IRQHandler,            // 64: PIT timer channel 0 interrupt
    PIT1_IRQHandler,            // 65: PIT timer channel 1 interrupt
    PIT2_IRQHandler,            // 66: PIT timer channel 2 interrupt
    PIT3_IRQHandler,            // 67: PIT timer channel 3 interrupt
    PDB0_IRQHandler,            // 68: PDB0 Interrupt
    USB0_IRQHandler,            // 69: USB0 interrupt
    Reserved70_IRQHandler,      // 70: Reserved interrupt
    Reserved71_IRQHandler,      // 71: Reserved interrupt
    DAC0_IRQHandler,            // 72: DAC0 interrupt
    MCG_IRQHandler,             // 73: MCG Interrupt
    LPTMR0_IRQHandler,          // 74: LPTimer interrupt
    PORTA_IRQHandler,           // 75: Port A interrupt
    PORTB_IRQHandler,           // 76: Port B interrupt
    PORTC_IRQHandler,           // 77: Port C interrupt
    PORTD_IRQHandler,           // 78: Port D interrupt
    PORTE_IRQHandler,           // 79: Port E interrupt
    SWI_IRQHandler,             // 80: Software interrupt
    Reserved81_IRQHandler,      // 81: Reserved interrupt
    Reserved82_IRQHandler,      // 82: Reserved interrupt
    Reserved83_IRQHandler,      // 83: Reserved interrupt
    Reserved84_IRQHandler,      // 84: Reserved interrupt
    Reserved85_IRQHandler,      // 85: Reserved interrupt
    Reserved86_IRQHandler,      // 86: Reserved interrupt
    Reserved87_IRQHandler,      // 87: Reserved interrupt
    Reserved88_IRQHandler,      // 88: Reserved interrupt
    ADC1_IRQHandler,            // 89: ADC1 interrupt


}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {

    // Disable interrupts
    __asm volatile ("cpsid i");


#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#else
    // Disable Watchdog
    //  Write 0xC520 to watchdog unlock register
    *((volatile unsigned short *)0x4005200E) = 0xC520;
    //  Followed by 0xD928 to complete the unlock
    *((volatile unsigned short *)0x4005200E) = 0xD928;
    // Now disable watchdog via STCTRLH register
    *((volatile unsigned short *)0x40052000) = 0x01D2u;
#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

